---
kind: property
id: P:Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Suffix
source: html/93b30615-3c24-79af-b1a1-a80e81b31f5b.htm
---
# Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Suffix Property

The suffix to include after the parameter value.

## Syntax (C#)
```csharp
public string Suffix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null